[
  {
    "id": "solarSystem",
    "name": "Solar System",
    "info": "Intergalactic Planetary was meticulously crafted as an ambitious endeavor for a thrilling week-long hackathon.  The team, consisting of three highly skilled and passionate developers, united through the dynamic Hackathon discord channel. With their unwavering dedication and boundless creativity, they embarked on an exhilarating journey, meticulously shaping a captivating idea. The team's meticulous planning involved the creation of tickets and tasks, seamlessly organized through a Trello board. Furthermore, they maintained daily communication via Discord, fostering a harmonious synergy that propelled the project forward.  The hackathon presented a unique challenge: to create a full-stack application that would enable students to delve into the awe-inspiring realm of the solar system. As an added twist, the team was required to style all the planets using CSS alone, showcasing their mastery of front-end design. Moreover, each planet was given its own distinctive page, brimming with captivating and distinct information, offering a comprehensive learning experience for students.  To bring this vision to life, the team employed cutting-edge technologies. The React framework was chosen to power the dynamic front-end, ensuring a seamless and interactive user interface. For the back-end infrastructure, a robust MySQL database was meticulously designed and implemented, leveraging the power of AWS for hosting and scalability.  Amidst fierce competition from five exceptional teams, we humbly stand as the triumphant victors. ",
    "bgColor": "#FFF2E2",
    "skills": [
      {
        "skillImg": "../../icons/mysql.png",
        "skillText": "mysql"
      },
      {
        "skillImg": "../../icons/express.svg",
        "skillText": "express"
      },
      {
        "skillImg": "../../icons/react.png",
        "skillText": "react"
      },
      {
        "skillImg": "../../icons/node.png",
        "skillText": "node"
      },
      {
        "skillImg": "../../icons/sass.png",
        "skillText": "sass"
      }
    ],
    "projectImg": "../../images/galatic.png",
    "backend": "https://github.com/revyrob/solarSystem/tree/main/solar-system-backend",
    "frontend": "https://github.com/revyrob/solarSystem/tree/main/solar-system-frontend",
    "deployed": "https://intergalactic-planetary.netlify.app/"
  },
  {
    "id": "brianconFantomes",
    "name": "Briancon Fantomes",
    "info": "Briancon Fantomes is an exceptional audio tour business nestled in the charming locale of Briancon, France. As a fully functional business page, it offers visitors an immersive experience through captivating audio tours available in both French and English, complemented by a comprehensive map highlighting all the tour stops.  To maximize its online presence and reach, the website cleverly utilizes cross-referencing with popular platforms such as Google, Facebook, Instagram, TripAdvisor, and Spotify. This strategic integration not only enhances the visibility of Briancon Fantomes but also amplifies its Search Engine Optimization (SEO), ensuring that it garners the attention it deserves.  To enhance the user experience, the page leverages the power of remarkable npm libraries such as Framer-motion and React-audio-player. These libraries contribute to the seamless navigation and immersive audio playback, elevating the overall quality of the audio tour experience.  Aesthetically, the website exudes elegance and modernity with its stylish design, thanks to the utilization of the Tailwind CSS framework. This choice of styling enhances the visual appeal and ensures a delightful browsing experience for visitors.  Effortlessly catering to the needs of a diverse audience, the website incorporates separate JSON files to store text content in both French and English. This intelligent design allows for easy language switching, facilitated by React useContext. Visitors can select their preferred language within the navbar, and the application dynamically adapts to their choice. Furthermore, to streamline the experience, the selected language preference is conveniently saved within the user's browser settings, providing a personalized and seamless browsing experience upon subsequent visits.  Briancon Fantomes stands as a shining example of a meticulously crafted audio tour business, seamlessly blending technology, captivating storytelling, and innovative design. It not only showcases the beauty and history of Briancon but also serves as a gateway for visitors to immerse themselves in an unforgettable journey through time and culture.",
    "bgColor": "#DFAF5E",
    "skills": [
      {
        "skillImg": "../../icons/react.png",
        "skillText": "react"
      },
      {
        "skillImg": "../../icons/tailwind.svg",
        "skillText": "tailwind"
      }
    ],
    "projectImg": "../../images/bFV2.png",
    "backend": "",
    "frontend": "https://github.com/revyrob/brianconFantomes-V2",
    "deployed": "https://brianconfantomes.com"
  },
  {
    "id": "motherEarth",
    "name": "Operation Mother Earth",
    "info": "Operation Mother Earth is an innovative and comprehensive full-stack application designed to educate children about the pressing issue of electronic waste. Rooted in React, this multi-page application seamlessly leverages MongoDB as its robust and reliable database.  The application features three engaging sections, each with a unique purpose. The Storyboard Game section invites children on an interactive journey, allowing them to explore the world of electronic waste through captivating storytelling. The Electronic Waste Recycling Center Finder, uses Google APIs to locate recycling centers within a 10km radius of the user.  The results are then mapped onto the interactive map and listed below the map.  The user can also add an e-waste recycling center to the map, using Google API Geocode.  The Education section further enhances learning through a combination of engaging videos and informative Q&A sessions.  Users can add their questions to the database, which will be answered at a later time.",
    "bgColor": "#FFF2E2",
    "skills": [
      {
        "skillImg": "../../icons/mongo.svg",
        "skillText": "mongo"
      },
      {
        "skillImg": "../../icons/express.svg",
        "skillText": "express"
      },
      {
        "skillImg": "../../icons/react.png",
        "skillText": "react"
      },
      {
        "skillImg": "../../icons/node.png",
        "skillText": "node"
      },
      {
        "skillImg": "../../icons/sass.png",
        "skillText": "sass"
      }
    ],
    "projectImg": "../../images/operation-mother-earth.png",
    "backend": "https://github.com/revyrob/operation-mother-earth/tree/main/operation-mother-earth_server",
    "frontend": "https://github.com/revyrob/operation-mother-earth/tree/main/operation-mother-earth_react",
    "deployed": "https://operation-mother-earth.netlify.app/"
  },

  {
    "id": "instock",
    "name": "Instock",
    "info": "Instock was a collaborative project at Brainstation, where a team of three ambitious software developers worked together for five days to create a comprehensive full-stack application. Our goal was to implement CRUD operations, establish seamless responsiveness across different window frame sizes, and enable multiple data tables to interact seamlessly.  To streamline our workflow, we utilized Jira tickets to organize tasks and ensure efficient task management. Additionally, all code commits were subjected to thorough team reviews to maintain code quality and cohesion.  The application we developed enables users to effortlessly add, remove, and edit warehouses from an existing warehouse list. Furthermore, users can manage the inventory of each warehouse, allowing for convenient item stocking.  We employed React for the frontend development, leveraging its powerful capabilities. On the backend, we utilized Node.js and Express to create a robust and efficient server. Data storage was accomplished using a JSON file stored on the backend, which we accessed through the RESTful APIs we developed.  Overall, our team successfully collaborated to deliver a responsive, user-friendly application with seamless data interaction and comprehensive CRUD functionality.",
    "bgColor": "#DFAF5E",
    "skills": [
      {
        "skillImg": "../../icons/express.svg",
        "skillText": "express"
      },
      {
        "skillImg": "../../icons/react.png",
        "skillText": "react"
      },
      {
        "skillImg": "../../icons/node.png",
        "skillText": "node"
      },
      {
        "skillImg": "../../icons/sass.png",
        "skillText": "sass"
      }
    ],
    "projectImg": "../../images/instock.png",
    "backend": "https://github.com/revyrob/instock-json/tree/main/instock-server",
    "frontend": "https://github.com/revyrob/instock-json/tree/main/instock-client",
    "deployed": ""
  }
]
